# InvalidFormularFoundInParameter Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..InvalidFormularFoundInParameter Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Invalid formular found in parameter '[Param Name]' in type '[Type Name]'.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InvalidFormularFoundInParameter { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidFormularFoundInParameter As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InvalidFormularFoundInParameter {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace